#include "optick.h"
#include "modengine/ext/profiling/profiling_extension.h"
#include "modengine/ext/profiling/main_loop.h"
#include "modengine/ext/profiling/thread_hooks.h"

namespace modengine::ext {
static std::unordered_map<const char*, void*> protobufDeserializeVTable = {
     {"FdpLogMessage::Vector", (void*) 0x140c653e0},
     {"FdpLogMessage::LevelUpLog", (void*) 0x140c629b0},
     {"FdpLogMessage::UseMagicLog", (void*) 0x140c65010},
     {"FdpLogMessage::UseMagicLog_Use_magic_info_list", (void*) 0x140c652a0},
     {"FdpLogMessage::ActGestureLog", (void*) 0x140c60a20},
     {"FdpLogMessage::ActGestureLog_Use_gesture_info_list", (void*) 0x140c60cb0},
     {"FdpLogMessage::BrokenEquipmentLog", (void*) 0x140c60df0},
     {"FdpLogMessage::UseItemLog", (void*) 0x140c64bd0},
     {"FdpLogMessage::UseItemLog_Use_item_info_list", (void*) 0x140c64e60},
     {"FdpLogMessage::PurchaseItemLog", (void*) 0x140c62e60},
     {"FdpLogMessage::PurchaseItemLog_Purchase_item_info_list", (void*) 0x140c63040},
     {"FdpLogMessage::GetItemLog", (void*) 0x140c61ed0},
     {"FdpLogMessage::GetItemLog_Get_item_info_list", (void*) 0x140c620b0},
     {"FdpLogMessage::DropItemLog", (void*) 0x140c61540},
     {"FdpLogMessage::DropItemLog_Throw_away_item_list", (void*) 0x140c61720},
     {"FdpLogMessage::LeaveItemLog", (void*) 0x140c62580},
     {"FdpLogMessage::LeaveItemLog_Set_item_info_list", (void*) 0x140c62760},
     {"FdpLogMessage::SaleItemLog", (void*) 0x140c63d60},

    { "Frpg2RequestMessage::VisitorData", (void*)0x14227b170 },
    { "Frpg2RequestMessage::RequestVisitResponse", (void*)0x14227a9b0 },
    { "Frpg2RequestMessage::RequestRejectVisitResponse", (void*)0x142279d50 },
    { "Frpg2RequestMessage::RequestNotifyRingBellResponse", (void*)0x1422793a0 },
    { "Frpg2RequestMessage::PushRequestNotifyRingBell", (void*)0x142275ef0 },
    { "Frpg2RequestMessage::RequestNotifyDisconnectSessionResponse", (void*)0x142278cf0 },
    { "Frpg2RequestMessage::RequestGetServerSidePlayerStatus", (void*)0x142278450 },
    { "Frpg2RequestMessage::PlayerStatusUploadConfig", (void*)0x142275af0 },
    { "Frpg2RequestMessage::PlayerInfoUploadConfigPushMessage", (void*)0x142275a60 },
    { "Frpg2RequestMessage::LoginClientInfo", (void*)0x142275370 },
    { "Frpg2RequestMessage::RankingData", (void*)0x1422767d0 },
    { "Frpg2RequestMessage::RankingRotationID", (void*)0x142276970 },
    { "Frpg2RequestMessage::RankingRecordCount", (void*)0x142276920 },
    { "Frpg2RequestMessage::RankingDataPack", (void*)0x142276890 },
    { "Frpg2RequestMessage::RequestRegisterRankingDataResponse", (void*)0x142279a90 },
    { "Frpg2RequestMessage::RequestGetOnlineShopItemListResponse_Lineup", (void*)0x142277e40 },
    { "Frpg2RequestMessage::RequestUnregisterQuickMatchResponse", (void*)0x14227a630 },
    { "Frpg2RequestMessage::RequestUpdateQuickMatchResponse", (void*)0x14227a880 },
    { "Frpg2RequestMessage::RequestJoinQuickMatchResponse", (void*)0x1422788b0 },
    { "Frpg2RequestMessage::RequestAcceptQuickMatchResponse", (void*)0x142276d50 },
    { "Frpg2RequestMessage::RequestRejectQuickMatchResponse", (void*)0x142279bf0 },
    { "Frpg2RequestMessage::RequestUpdateSignResponse", (void*)0x14227a900 },
    { "Frpg2RequestMessage::RequestRemoveSignResponse", (void*)0x142279ee0 },
    { "Frpg2RequestMessage::RequestSummonSignResponse", (void*)0x14227a5a0 },
    { "Frpg2RequestMessage::RequestRejectSignResponse", (void*)0x142279ca0 },
    { "Frpg2RequestMessage::RequestRemoveMarkResponse", (void*)0x142279e60 },
    { "Frpg2RequestMessage::RequestReentryMarkResponse", (void*)0x142279950 },
    { "Frpg2RequestMessage::LogCommonInfo", (void*)0x1422752f0 },
    { "Frpg2RequestMessage::RequestGetRightMatchingArea", (void*)0x1422782f0 },
    { "Frpg2RequestMessage::RequestGetRightMatchingAreaResponse_Area_info", (void*)0x1422783c0 },
    { "Frpg2RequestMessage::RequestGetCurrentRank", (void*)0x1422779b0 },
    { "Frpg2RequestMessage::RequestGetCurrentRankResponse", (void*)0x1422779d0 },
    { "Frpg2RequestMessage::QuickMatchRankCache", (void*)0x142276510 },
    { "Frpg2RequestMessage::RequestPushSendQuickMatchStart", (void*)0x1422794d0 },
    { "Frpg2RequestMessage::QuickMatchSession", (void*)0x142276670 },
    { "Frpg2RequestMessage::QuickMatchSession_Result_list", (void*)0x142276700 },
    { "Frpg2RequestMessage::QuickMatchApologyPoint", (void*)0x142276400 },
    { "Frpg2PlayerData::DateTime", (void*)0x1422983a0 }
};

// Prelude struct that stores constant data associated with a hook
struct ProfilerPreludeData {
    const char* zone; // 0x00
    uintptr_t original_address; // 0x08
    uintptr_t profiler_entry_address; // 0x10
    uintptr_t profiler_exit_address; // 0x18
    uintptr_t profiler_epilogue_address; // 0x20
    DWORD tls_index; // 0x28
    DWORD _pad; // 0x2C
}; // Total size: 0x30

// Runtime context data associated with a call to a hook
struct ProfilerContextData {
    uintptr_t return_address; // 0x00
    uint64_t rbx; // 0x08
    uint64_t r12; // 0x10
}; // Total size: 0x18

void ProfilingExtension::on_attach()
{
    info("Setting up profiler");

    // Thread local storage to allocate per-thread context stacks
    m_tls_idx = TlsAlloc();
    if (m_tls_idx == TLS_OUT_OF_INDEXES) {
        error("Could not allocate TLS index for profiler");
        return;
    }

    // Hooks main loop to install Optick main loop event
    hooked_MainLoop = register_hook(DS3, 0x140eccb30, tMainLoop);

    // Registers engine created DLThreads with Optick
    hooked_DLThreadHandler = register_hook(DS3, 0x1417ef4b0, tDLThreadHandler);

    for (auto const& [key, val] : protobufDeserializeVTable)
    {
        install_profiler_zone((uintptr_t)val, key);
    }

    for (auto const& [key, val] : protobufSerializeVTable) {
        install_profiler_zone((uintptr_t)val, key);
    }

    // Zones for functions called by the main loop tick
    install_profiler_zone(0x140ee4d10, "fun_140ee4d10");
